<p style="font-family: Arial; font-size:3.75em;color:purple; font-style:bold"><br>
Lecture 2: Pandas</p><br>

Pandas is a primary data analysis library in Python. It offers a number of operations to aid in data exploration, cleaning and transformation, making it one of the most popular data science tools. To name a few examples of these operations, Pandas enables various methods to handle missing data and data pivoting, easy data sorting and description capabilities, fast generation of data plots, and Boolean indexing for fast image processing and other masking operations.

Pandas makes use of two different data structures: Series and DataFrames. A series is a one-dimensional array-like object that act like ndarrays. They provide many ways to index data and support lots of data types. Because of their similarities to ndarrays, series' are valid arguments to most Numpy methods as well. A DataFrame is a two-dimensional flexible data structure that supports heterogeneous data with labeled axes for rows and columns. We think of DataFrames as containers for series objects, where each row is a series. It is these two incredibly important data structures that make Pandas so useful and well-liked.

Some of the key features of Pandas are:
* Ingestion and manipulation of heterogeneous data types
* Generating descriptive statistics on data to support exploration and communication
* Data cleaning using built in pandas functions
* Frequent data operations for subsetting, filtering, insertion, deletion and aggregation of data
* Merging and joining multiple datasets using dataframes
* Working with timestamps and time-series data

Pandas also builds upon numpy and other Python packages to provide easy-to-use data structures and data manipulation functions with integrated indexing.

**Additional Recommended Resources:** 
* <a href="http://pandas.pydata.org/pandas-docs/stable/">Pandas Documentation</a><br>
* *Python for Data Analysis* by Wes McKinney
* *Python Data Science Handbook* by Jake VanderPlas

Now that you know a little background about Pandas, let's get started with some code!

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold"><br>

Importing the Pandas Library
</p>

As you saw in the Numpy notes, the "as" keyword in the import statement allows us to give a local name to the pandas package, so that we can refer to it as "pd" rather than "pandas" in subsequent code.

In [220]:
import pandas as pd

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Introduction to Pandas Data Structures</p>
<br>
Pandas uses two different data structures: Series and DataFrames. First, we will explore Series in the code below. 

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Series in Pandas</p>

Pandas Series are one-dimensional labeled arrays. They act like ndarrays, so are valid arguments to most Numpy methods because of their similarities. Series support many data types, including integers, strings, floating point numbers,
Python objects, etc., as a part of the array. Their axis labels are collectively referred to as the index, and we can get and set values by these index labels. You can think of a Series as a flexible dictionary-like object.

In the following code, we explore the following methods associated with Series:

**pd.Series([data elements], [index elements])** creates a Series object with the elements specified between the brackets (data in the first set of brackets, indices in the second). Note that the elements in the data set and the index set do not have to be of the same data type. For example, your data set could look something like ['foo', 12, 19.8], and your index set could look like [99.0, 'bar', 3].

**nameOfSeries.index** returns a list of the indices in the Series.

(a) **nameOfSeries.loc[index]** OR (b) **nameOfSeries.loc[[indices]]** returns (a) the data at the specified index or (b) the data and their indices at the specified indices.

(a) **nameOfSeries.iloc[position]** OR (b) **nameOfSeries.iloc[[positions]]** returns (a) the data at the specified position in the data list or (b) the data and their indices at the specified positions of the data list.

*index* **in** *nameOfSeries* returns a boolean value of whether or not the index is in the Series.

In [221]:
# create a Series called sr
sr = pd.Series([10, 'foo', 30, 90.4], ['peach', 'plum', 'dog', 'band'])

In [222]:
# view the Series
sr

peach      10
plum      foo
dog        30
band     90.4
dtype: object

In [223]:
# view the indices
sr.index

Index(['peach', 'plum', 'dog', 'band'], dtype='object')

In [224]:
# access the data at an index
sr['plum']

'foo'

In [225]:
# OR
sr.loc['plum']

'foo'

In [226]:
# access the data at multiple indices
sr[['peach', 'band']]

peach      10
band     90.4
dtype: object

In [227]:
# OR
sr.loc[['peach', 'band']]

peach      10
band     90.4
dtype: object

You can see that the data is represented so that you can access it like a list with numeric indices (list[x]) or more like a dictionary (dic['key']).

In [228]:
# access a data element by position in the list
sr[2]

30

In [229]:
# OR
sr.iloc[2]

30

In [230]:
# access multiple data elements by positions in the list
sr[[0, 1, 2]]

peach     10
plum     foo
dog       30
dtype: object

In [231]:
# OR
sr.iloc[[1, 2, 3]]

plum     foo
dog       30
band    90.4
dtype: object

In [232]:
# is the index 'peach' in the Series?
'peach' in sr

True

We can also use basic Python operations like multiplication on a Series. In the code below, we multiply the whole Series by 2. Note that this operation is performed on all data types, even strings, where the string is doubled.

In [233]:
sr * 2

peach        20
plum     foofoo
dog          60
band      180.8
dtype: object

We can square the numerical index values in a Series. If we tried to square an index that's not a numeric data type, however, we would get an error.

In [234]:
sr[['peach', 'band']] ** 2

peach        100
band     8172.16
dtype: object

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
DataFrames in Pandas</p>

Pandas DataFrames are flexible 2-dimensional labeled data structures. They also support heterogeneous data and have labeled axes for rows and columns. We can think of a DataFrame as a container for Series objects, where each row is a Series.

Let's look at an example!

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Creating a DataFrame</p>

There are many ways to create Pandas DataFrames. We often just read and ingest data into a data frame, but in this example, we create the DataFrame manually by starting with a dictionary of Series. Note that we are adding another dimensions to our data structure, so we need to label each Series. Here, we label the first Series 'a' and the second 'b'.

In [235]:
# create a dictionary called df_data
df_data = {'a' : pd.Series([1., 2., 3., 4.], index=['dog', 'cat', 'fruit', 'bird']),
     'b' : pd.Series([10., 20., 30.], index=['cake', 'fruit', 'ice cream'])}

We then use the following methods to create and explore the DataFrame:

**pandas.DataFrame(data)** creates a DataFrame out of the specified data. This data can be provided in the form of a Numpy ndarray, a Python dictionary, or another DataFrame. There are other parameters in this method, so we advise you to check out the <a href="https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html">DataFrame Documentation</a>.

**nameOfDataFrame.index** returns a list of all of the unique indices in the Data Frame.

**nameOfDataFrame.columns** returns a list of the names of the Series, or columns, that make up the DataFrame.

In [236]:
# create and output the DataFrame
df = pd.DataFrame(df_data)
df

             a     b
bird       4.0   NaN
cake       NaN  10.0
cat        2.0   NaN
dog        1.0   NaN
fruit      3.0  20.0
ice cream  NaN  30.0

Series 'a' and 'b' don't share the all of same indices. When we print the DataFrame, we see NaN values, which indicate that the Series does not contain a certain index.

In [237]:
df.index

Index(['bird', 'cake', 'cat', 'dog', 'fruit', 'ice cream'], dtype='object')

In [238]:
df.columns

Index(['a', 'b'], dtype='object')

We can also create a smaller DataFrame using a subset of the same data,  this time specifying which indices we want to be included.

In [239]:
pd.DataFrame(df_data, index=['dog', 'fruit', 'bird'])

         a     b
dog    1.0   NaN
fruit  3.0  20.0
bird   4.0   NaN

By specifying the column parameter, you can select which columns you'd like the new DataFrame to include. In the code below, we ask the DataFrame to include column 'e', which doesn't exist in the original dictionary. Because of this, a new column 'e' will be created with all its entries as NaN.

In [240]:
pd.DataFrame(df_data, index=['dog', 'fruit', 'bird'], columns=['a', 'e'])

         a    e
dog    1.0  NaN
fruit  3.0  NaN
bird   4.0  NaN

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Creating a DataFrame from a list of Python dictionaries</p>

Another way to create a DataFrame is to use a list of Python dictionaries as your data. In the code below, we create a list of Python dictionaries called 'df_data2' and use this to make a DataFrame called 'df2'. We then use many of the same techniques as above to explore the DataFrame.

Please see <a href="https://docs.python.org/3/tutorial/datastructures.html#dictionaries">this link</a> for a reminder on Python dictionaries.

In [241]:
# create a Python dictionary

df_data2 = [{'apple': 5, 'cherry': 10}, {'peter': 1, 'emily': 2, 'brian': 6}]

In [242]:
# labels get created as column headers

pd.DataFrame(df_data2)

   apple  brian  cherry  emily  peter
0    5.0    NaN    10.0    NaN    NaN
1    NaN    6.0     NaN    2.0    1.0

In [243]:
# rename the rows from 0 and 1 to 'blue' and 'yellow' by specifying the index parameter

pd.DataFrame(df_data2, index=['blue', 'yellow'])

        apple  brian  cherry  emily  peter
blue      5.0    NaN    10.0    NaN    NaN
yellow    NaN    6.0     NaN    2.0    1.0

In [244]:
# create a smaller DataFrame by specifying the columns

pd.DataFrame(df_data2, columns=['cherry', 'emily','brian'])

   cherry  emily  brian
0    10.0    NaN    NaN
1     NaN    2.0    6.0

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Exploring some basic DataFrame operations</p>

Now let's look into how we can get data out of a DataFrame with some basic DataFrame operations. In the following code, we will use these DataFrame methods:

**nameOfDataFrame.pop(columnName)** removes and returns the specified column from the DataFrame. If you want to save the popped column, you must store it as a new variable.

**del** *nameOfDataFrame[columnName]* deletes a column from a DataFrame permanently.

**nameOfDataFrame.insert(location, newColumnName, values)** inserts a column with specified name into the DataFrame at the specified location with specified values.

In [245]:
df

             a     b
bird       4.0   NaN
cake       NaN  10.0
cat        2.0   NaN
dog        1.0   NaN
fruit      3.0  20.0
ice cream  NaN  30.0

In [246]:
# display only column 'a' of the DataFrame

df['a']

bird         4.0
cake         NaN
cat          2.0
dog          1.0
fruit        3.0
ice cream    NaN
Name: a, dtype: float64

In [247]:
# create a new column 'c' by adding 'a' and 'b' together

df['c'] = df['a'] + df['b']
df

             a     b     c
bird       4.0   NaN   NaN
cake       NaN  10.0   NaN
cat        2.0   NaN   NaN
dog        1.0   NaN   NaN
fruit      3.0  20.0  23.0
ice cream  NaN  30.0   NaN

Note that since NaN values cannot be added to floating point values, the resulting values in 'c' are NaN. For index 'fruit', however, both 'a' and 'b' are floating point values and can be added together.

In [248]:
# create a new column 'd' of boolean values indicating whether or not an index's value in 'a' is greater than 2.0
# NaN values evaluate to False

df['d'] = df['a'] > 2.0
df

             a     b     c      d
bird       4.0   NaN   NaN   True
cake       NaN  10.0   NaN  False
cat        2.0   NaN   NaN  False
dog        1.0   NaN   NaN  False
fruit      3.0  20.0  23.0   True
ice cream  NaN  30.0   NaN  False

In [249]:
# set cee equal to the 'c' column in the DataFrame

cee = df.pop('c')

In [250]:
cee

bird          NaN
cake          NaN
cat           NaN
dog           NaN
fruit        23.0
ice cream     NaN
Name: c, dtype: float64

In [251]:
# the pop method has removed 'c' from df

df

             a     b      d
bird       4.0   NaN   True
cake       NaN  10.0  False
cat        2.0   NaN  False
dog        1.0   NaN  False
fruit      3.0  20.0   True
ice cream  NaN  30.0  False

In [252]:
# delete column 'b' from the DataFrame

del df['b']

In [253]:
df

             a      d
bird       4.0   True
cake       NaN  False
cat        2.0  False
dog        1.0  False
fruit      3.0   True
ice cream  NaN  False

In [254]:
# insert a new column that is a copy of column 'a'

df.insert(2, 'copy_of_a', df['a'])
df

             a      d  copy_of_a
bird       4.0   True        4.0
cake       NaN  False        NaN
cat        2.0  False        2.0
dog        1.0  False        1.0
fruit      3.0   True        3.0
ice cream  NaN  False        NaN

In [255]:
# insert a new column that is a copy of 'a' up to excluding the value at the third position of the Series. The rest of the
# column is NaNs

df['a_upper_half'] = df['a'][:3]
df

             a      d  copy_of_a  a_upper_half
bird       4.0   True        4.0           4.0
cake       NaN  False        NaN           NaN
cat        2.0  False        2.0           2.0
dog        1.0  False        1.0           NaN
fruit      3.0   True        3.0           NaN
ice cream  NaN  False        NaN           NaN

Note that while both methods above (df.insert and df['col']) allowed us to insert new columns into the DataFrame, only df.insert lets us specify which position we want the column to be in.

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Case Study: Air Quality Dataset </p>
<br>This notebook uses a dataset from the UC Irvine website. We will describe the dataset further as we explore with it using *pandas*. 

## Download the Dataset

Please note that **you will need to download the dataset** from the UC Irvine Machine Learning Dataset Repository. 

You can find the data at http://archive.ics.uci.edu/ml/machine-learning-databases/00360/. Please unzip the file at a filepath of your choice. 

Here are instructions on how to unzip a file in Windows: https://support.microsoft.com/en-us/help/14200/windows-compress-uncompress-zip-files. 
For Macs, simply double-click on the file.

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Use Pandas to Read the Dataset<br>
</p>
<br>
In this notebook, we will be using a CSV file:
* **AirQualityUCI.csv :** 

The dataset contains over 9000 measurements of air quality taken over a year. 

The following are the measures taken: 
Date	Time	CO(GT)	PT08.S1(CO)	NMHC(GT)	C6H6(GT)	PT08.S2(NMHC)	NOx(GT)	PT08.S3(NOx)	NO2(GT)	PT08.S4(NO2)	PT08.S5(O3)	T	RH	AH



Using the *read_csv* function in pandas, we will transfer this information into our code.

In [256]:
filepath = 'C:/Users/Shubhom/Downloads/AirQualityUCI.csv'
airquality = pd.read_csv(filepath,sep=',',delimiter=';')
print(type(airquality))
airquality.head(15)

<class 'pandas.core.frame.DataFrame'>

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH,Unnamed: 15,Unnamed: 16
0,10/03/2004,18.00.00,"2,6",1360.0,150.0,"11,9",1046.0,166.0,1056.0,113.0,1692.0,1268.0,"13,6","48,9","0,7578",NaN,NaN
1,10/03/2004,19.00.00,2,1292.0,112.0,"9,4",955.0,103.0,1174.0,92.0,1559.0,972.0,"13,3","47,7","0,7255",NaN,NaN
2,10/03/2004,20.00.00,"2,2",1402.0,88.0,"9,0",939.0,131.0,1140.0,114.0,1555.0,1074.0,"11,9","54,0","0,7502",NaN,NaN
3,10/03/2004,21.00.00,"2,2",1376.0,80.0,"9,2",948.0,172.0,1092.0,122.0,1584.0,1203.0,"11,0","60,0","0,7867",NaN,NaN
4,10/03/2004,22.00.00,"1,6",1272.0,51.0,"6,5",836.0,131.0,1205.0,116.0,1490.0,1110.0,"11,2","59,6","0,7888",NaN,NaN
5,10/03/2004,23.00.00,"1,2",1197.0,38.0,"4,7",750.0,89.0,1337.0,96.0,1393.0,949.0,"11,2","59,2","0,7848",NaN,NaN
6,11/03/2004,00.00.00,"1,2",1185.0,31.0,"3,6",690.0,62.0,1462.0,77.0,1333.0,733.0,"11,3","56,8","0,7603",NaN,NaN
7,11/03/2004,01.00.00,1,1136.0,31.0,"3,3",672.0,62.0,1453.0,76.0,1333.0,730.0,"10,7","60,0","0,7702",NaN,NaN
8,11/03/2004,02.00.00,"0,9",1094.0,24.0,"2,3",609.0,45.0,1579.0,60.0,1276.0,620.0,"10,7","59,7","0,7648",NaN,NaN
9,11/03/2004,03.00.00,"0,6",1010.0,19.0,"1,7",561.0,-200.0,1705.0,-200.0,1235.0,501.0,"10,3","60,2","0,7517",NaN,NaN
10,11/03/2004,04.00.00,-200,1011.0,14.0,"1,3",527.0,21.0,1818.0,34.0,1197.0,445.0,"10,1","60,5","0,7465",NaN,NaN
11,11/03/2004,05.00.00,"0,7",1066.0,8.0,"1,1",512.0,16.0,1918.0,28.0,1182.0,422.0,"11,0","56,2","0,7366",NaN,NaN
12,11/03/2004,06.00.00,"0,7",1052.0,16.0,"1,6",553.0,34.0,1738.0,48.0,1221.0,472.0,"10,5","58,1","0,7353",NaN,NaN
13,11/03/2004,07.00.00,"1,1",1144.0,29.0,"3,2",667.0,98.0,1490.0,82.0,1339.0,730.0,"10,2","59,6","0,7417",NaN,NaN
14,11/03/2004,08.00.00,2,1333.0,64.0,"8,0",900.0,174.0,1136.0,112.0,1517.0,1102.0,"10,8","57,4","0,7408",NaN,NaN

Our dataset is loaded and looks ok, but it looks like there's some cleaning that needs to be done. Notice how the last two columns are unnamed and how the C6H6(GT) and T columns have values with commas.In this case, the commas are <i>not</i> delimiters but are instead substites for decimal points. However, the following code block shows why Python is really useful.

In [257]:
airquality_comma = pd.read_csv(filepath, delimiter=';|,',engine='python',index_col=False)
airquality_comma.head(15)

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH,Unnamed: 15,Unnamed: 16
0,10/03/2004,18.00.00,2.0,6.0,1360.0,150.0,11.0,9.0,1046.0,166.0,1056.0,113.0,1692.0,1268.0,13.0,6.0,48.0
1,10/03/2004,19.00.00,2.0,1292.0,112.0,9.0,4.0,955.0,103.0,1174.0,92.0,1559.0,972.0,13.0,3.0,47.0,7.0
2,10/03/2004,20.00.00,2.0,2.0,1402.0,88.0,9.0,0.0,939.0,131.0,1140.0,114.0,1555.0,1074.0,11.0,9.0,54.0
3,10/03/2004,21.00.00,2.0,2.0,1376.0,80.0,9.0,2.0,948.0,172.0,1092.0,122.0,1584.0,1203.0,11.0,0.0,60.0
4,10/03/2004,22.00.00,1.0,6.0,1272.0,51.0,6.0,5.0,836.0,131.0,1205.0,116.0,1490.0,1110.0,11.0,2.0,59.0
5,10/03/2004,23.00.00,1.0,2.0,1197.0,38.0,4.0,7.0,750.0,89.0,1337.0,96.0,1393.0,949.0,11.0,2.0,59.0
6,11/03/2004,00.00.00,1.0,2.0,1185.0,31.0,3.0,6.0,690.0,62.0,1462.0,77.0,1333.0,733.0,11.0,3.0,56.0
7,11/03/2004,01.00.00,1.0,1136.0,31.0,3.0,3.0,672.0,62.0,1453.0,76.0,1333.0,730.0,10.0,7.0,60.0,0.0
8,11/03/2004,02.00.00,0.0,9.0,1094.0,24.0,2.0,3.0,609.0,45.0,1579.0,60.0,1276.0,620.0,10.0,7.0,59.0
9,11/03/2004,03.00.00,0.0,6.0,1010.0,19.0,1.0,7.0,561.0,-200.0,1705.0,-200.0,1235.0,501.0,10.0,3.0,60.0
10,11/03/2004,04.00.00,-200.0,1011.0,14.0,1.0,3.0,527.0,21.0,1818.0,34.0,1197.0,445.0,10.0,1.0,60.0,5.0
11,11/03/2004,05.00.00,0.0,7.0,1066.0,8.0,1.0,1.0,512.0,16.0,1918.0,28.0,1182.0,422.0,11.0,0.0,56.0
12,11/03/2004,06.00.00,0.0,7.0,1052.0,16.0,1.0,6.0,553.0,34.0,1738.0,48.0,1221.0,472.0,10.0,5.0,58.0
13,11/03/2004,07.00.00,1.0,1.0,1144.0,29.0,3.0,2.0,667.0,98.0,1490.0,82.0,1339.0,730.0,10.0,2.0,59.0
14,11/03/2004,08.00.00,2.0,1333.0,64.0,8.0,0.0,900.0,174.0,1136.0,112.0,1517.0,1102.0,10.0,8.0,57.0,4.0

We've made our data a lot more usable in just one line of code. Some pointers:
- the delimiter parameter in read_csv is capable of taking a "regex", which allows you to, in this case, insert a boolean expression for which characters are delimiters (the semicolon OR the comma) 
- the 'python' engine parameter enables us to use a regex delimiter
- index_col is set to False because our first line of column names does not terminate in a delimiter. 

We're not going to use airquality_comma because we know that the comma is not a delimiter, but we've figured out how to manipulate delimiters somewhat in the event that it was.

In [258]:
del (airquality_comma)

You might still be wondering how to fix the issue with the commas for decimals. It turns out it's just one more parameter in read_csv. We'll also delete the last two columns pandas has interpreted, because they contain no information.

In [324]:
airquality = pd.read_csv(filepath,sep=',',delimiter=';',decimal=',')
del (airquality['Unnamed: 15'])
airquality.pop('Unnamed: 16') #There are a couple ways to get rid of the columns
airquality.head(15)

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,10/03/2004,18.00.00,2.6,1360.0,150.0,11.9,1046.0,166.0,1056.0,113.0,1692.0,1268.0,13.6,48.9,0.7578
1,10/03/2004,19.00.00,2.0,1292.0,112.0,9.4,955.0,103.0,1174.0,92.0,1559.0,972.0,13.3,47.7,0.7255
2,10/03/2004,20.00.00,2.2,1402.0,88.0,9.0,939.0,131.0,1140.0,114.0,1555.0,1074.0,11.9,54.0,0.7502
3,10/03/2004,21.00.00,2.2,1376.0,80.0,9.2,948.0,172.0,1092.0,122.0,1584.0,1203.0,11.0,60.0,0.7867
4,10/03/2004,22.00.00,1.6,1272.0,51.0,6.5,836.0,131.0,1205.0,116.0,1490.0,1110.0,11.2,59.6,0.7888
5,10/03/2004,23.00.00,1.2,1197.0,38.0,4.7,750.0,89.0,1337.0,96.0,1393.0,949.0,11.2,59.2,0.7848
6,11/03/2004,00.00.00,1.2,1185.0,31.0,3.6,690.0,62.0,1462.0,77.0,1333.0,733.0,11.3,56.8,0.7603
7,11/03/2004,01.00.00,1.0,1136.0,31.0,3.3,672.0,62.0,1453.0,76.0,1333.0,730.0,10.7,60.0,0.7702
8,11/03/2004,02.00.00,0.9,1094.0,24.0,2.3,609.0,45.0,1579.0,60.0,1276.0,620.0,10.7,59.7,0.7648
9,11/03/2004,03.00.00,0.6,1010.0,19.0,1.7,561.0,-200.0,1705.0,-200.0,1235.0,501.0,10.3,60.2,0.7517
10,11/03/2004,04.00.00,-200.0,1011.0,14.0,1.3,527.0,21.0,1818.0,34.0,1197.0,445.0,10.1,60.5,0.7465
11,11/03/2004,05.00.00,0.7,1066.0,8.0,1.1,512.0,16.0,1918.0,28.0,1182.0,422.0,11.0,56.2,0.7366
12,11/03/2004,06.00.00,0.7,1052.0,16.0,1.6,553.0,34.0,1738.0,48.0,1221.0,472.0,10.5,58.1,0.7353
13,11/03/2004,07.00.00,1.1,1144.0,29.0,3.2,667.0,98.0,1490.0,82.0,1339.0,730.0,10.2,59.6,0.7417
14,11/03/2004,08.00.00,2.0,1333.0,64.0,8.0,900.0,174.0,1136.0,112.0,1517.0,1102.0,10.8,57.4,0.7408

<h1 style="font-size:2em;color:#2467C0">Data Structures </h1>

<h1 style="font-size:1.5em;color:#2467C0">Series</h1>

Next, let's observe how pandas interprets our data as Series and DataFrame objects, and how we can leverage that to get information about the data.

In [325]:
#Extract 0th row: notice that it is infact a Series

row_0 = airquality.iloc[0]
type(row_0)

pandas.core.series.Series

In [326]:
print(row_0)

Date             10/03/2004
Time               18.00.00
CO(GT)                  2.6
PT08.S1(CO)            1360
NMHC(GT)                150
C6H6(GT)               11.9
PT08.S2(NMHC)          1046
NOx(GT)                 166
PT08.S3(NOx)           1056
NO2(GT)                 113
PT08.S4(NO2)           1692
PT08.S5(O3)            1268
T                      13.6
RH                     48.9
AH                   0.7578
Name: 0, dtype: object

In [327]:
row_0.index

Index(['Date', 'Time', 'CO(GT)', 'PT08.S1(CO)', 'NMHC(GT)', 'C6H6(GT)',
       'PT08.S2(NMHC)', 'NOx(GT)', 'PT08.S3(NOx)', 'NO2(GT)', 'PT08.S4(NO2)',
       'PT08.S5(O3)', 'T', 'RH', 'AH'],
      dtype='object')

In [328]:
row_0['Time']

'18.00.00'

In [329]:
'RH' in row_0

True

In [330]:
row_0.name

0

In [331]:
row_0 = row_0.rename('first_row')
row_0.name

'first_row'

<h1 style="font-size:1.5em;color:#2467C0">DataFrames </h1>

In [332]:
airquality.head()

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,10/03/2004,18.00.00,2.6,1360.0,150.0,11.9,1046.0,166.0,1056.0,113.0,1692.0,1268.0,13.6,48.9,0.7578
1,10/03/2004,19.00.00,2.0,1292.0,112.0,9.4,955.0,103.0,1174.0,92.0,1559.0,972.0,13.3,47.7,0.7255
2,10/03/2004,20.00.00,2.2,1402.0,88.0,9.0,939.0,131.0,1140.0,114.0,1555.0,1074.0,11.9,54.0,0.7502
3,10/03/2004,21.00.00,2.2,1376.0,80.0,9.2,948.0,172.0,1092.0,122.0,1584.0,1203.0,11.0,60.0,0.7867
4,10/03/2004,22.00.00,1.6,1272.0,51.0,6.5,836.0,131.0,1205.0,116.0,1490.0,1110.0,11.2,59.6,0.7888

In [333]:
airquality.index

RangeIndex(start=0, stop=9471, step=1)

In [334]:
airquality.columns

Index(['Date', 'Time', 'CO(GT)', 'PT08.S1(CO)', 'NMHC(GT)', 'C6H6(GT)',
       'PT08.S2(NMHC)', 'NOx(GT)', 'PT08.S3(NOx)', 'NO2(GT)', 'PT08.S4(NO2)',
       'PT08.S5(O3)', 'T', 'RH', 'AH'],
      dtype='object')

In [335]:
# Extract row 0, 11, 2000 from DataFrame

airquality.iloc[ [0,11,2000] ]

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
0,10/03/2004,18.00.00,2.6,1360.0,150.0,11.9,1046.0,166.0,1056.0,113.0,1692.0,1268.0,13.6,48.9,0.7578
11,11/03/2004,05.00.00,0.7,1066.0,8.0,1.1,512.0,16.0,1918.0,28.0,1182.0,422.0,11.0,56.2,0.7366
2000,02/06/2004,02.00.00,-200.0,887.0,-200.0,4.9,758.0,43.0,1094.0,38.0,1622.0,804.0,19.1,69.0,1.5043

<h1 style="font-size:2em;color:#2467C0">Descriptive Statistics</h1>

Pandas also provides some basic quantitative functions to understand our data.

In [336]:
airquality['NO2(GT)'].describe()

count    9357.000000
mean       58.148873
std       126.940455
min      -200.000000
25%        53.000000
50%        96.000000
75%       133.000000
max       340.000000
Name: NO2(GT), dtype: float64

In [337]:
airquality.describe()

,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
count,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000,9357.000000
mean,-34.207524,1048.990061,-159.090093,1.865683,894.595276,168.616971,794.990168,58.148873,1391.479641,975.072032,9.778305,39.485380,-6.837604
std,77.657170,329.832710,139.789093,41.380206,342.333252,257.433866,321.993552,126.940455,467.210125,456.938184,43.203623,51.216145,38.976670
min,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000,-200.000000
25%,0.600000,921.000000,-200.000000,4.000000,711.000000,50.000000,637.000000,53.000000,1185.000000,700.000000,10.900000,34.100000,0.692300
50%,1.500000,1053.000000,-200.000000,7.900000,895.000000,141.000000,794.000000,96.000000,1446.000000,942.000000,17.200000,48.600000,0.976800
75%,2.600000,1221.000000,-200.000000,13.600000,1105.000000,284.000000,960.000000,133.000000,1662.000000,1255.000000,24.100000,61.900000,1.296200
max,11.900000,2040.000000,1189.000000,63.700000,2214.000000,1479.000000,2683.000000,340.000000,2775.000000,2523.000000,44.600000,88.700000,2.231000

In [338]:
airquality['NMHC(GT)'].mean()

-159.09009297851875

In [339]:
airquality.mean()

CO(GT)            -34.207524
PT08.S1(CO)      1048.990061
NMHC(GT)         -159.090093
C6H6(GT)            1.865683
PT08.S2(NMHC)     894.595276
NOx(GT)           168.616971
PT08.S3(NOx)      794.990168
NO2(GT)            58.148873
PT08.S4(NO2)     1391.479641
PT08.S5(O3)       975.072032
T                   9.778305
RH                 39.485380
AH                 -6.837604
dtype: float64

In [340]:
airquality['C6H6(GT)'].min()

-200.0

In [341]:
airquality['NOx(GT)'].max()

1479.0

In [342]:
airquality['NOx(GT)'].std()

257.4338662910738

In [343]:
airquality['T'].mode()

0   -200.0
dtype: float64

In [344]:
airquality.corr()

,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH
CO(GT),1.000000,0.041411,0.128351,-0.031378,0.029926,0.526451,-0.089981,0.671127,-0.073724,0.080310,-0.068939,-0.048227,-0.045892
PT08.S1(CO),0.041411,1.000000,0.170007,0.852687,0.933102,0.277993,0.087019,0.154030,0.845149,0.892434,0.754844,0.745375,0.764903
NMHC(GT),0.128351,0.170007,1.000000,0.037323,0.110104,-0.004427,0.048821,0.103307,0.162680,0.101185,-0.000009,0.008284,0.012500
C6H6(GT),-0.031378,0.852687,0.037323,1.000000,0.767433,-0.001174,0.512193,-0.010992,0.774673,0.641334,0.971375,0.925062,0.984555
PT08.S2(NMHC),0.029926,0.933102,0.110104,0.767433,1.000000,0.331272,-0.073667,0.176488,0.874782,0.909905,0.669025,0.585803,0.646572
NOx(GT),0.526451,0.277993,-0.004427,-0.001174,0.331272,1.000000,-0.436084,0.817139,0.035546,0.461889,-0.138452,-0.053009,-0.095847
PT08.S3(NOx),-0.089981,0.087019,0.048821,0.512193,-0.073667,-0.436084,1.000000,-0.256232,0.122734,-0.208865,0.588111,0.573549,0.621618
NO2(GT),0.671127,0.154030,0.103307,-0.010992,0.176488,0.817139,-0.256232,1.000000,-0.022174,0.253439,-0.084104,-0.081305,-0.060440
PT08.S4(NO2),-0.073724,0.845149,0.162680,0.774673,0.874782,0.035546,0.122734,-0.022174,1.000000,0.723690,0.755060,0.640707,0.691913
PT08.S5(O3),0.080310,0.892434,0.101185,0.641334,0.909905,0.461889,-0.208865,0.253439,0.723690,1.000000,0.503700,0.524955,0.519467
T,-0.068939,0.754844,-0.000009,0.971375,0.669025,-0.138452,0.588111,-0.084104,0.755060,0.503700,1.000000,0.885911,0.981001
RH,-0.048227,0.745375,0.008284,0.925062,0.585803,-0.053009,0.573549,-0.081305,0.640707,0.524955,0.885911,1.000000,0.943995
AH,-0.045892,0.764903,0.012500,0.984555,0.646572,-0.095847,0.621618,-0.060440,0.691913,0.519467,0.981001,0.943995,1.000000

We can also filter information conditionally.

In [345]:
filter_1 = airquality['CO(GT)'] > 3.0
print(filter_1)
filter_1.any()

0       False
1       False
2       False
3       False
4       False
5       False
6       False
7       False
8       False
9       False
10      False
11      False
12      False
13      False
14      False
15      False
16      False
17      False
18      False
19      False
20      False
21      False
22      False
23      False
24       True
25       True
26       True
27       True
28      False
29      False
        ...
9441    False
9442    False
9443    False
9444    False
9445    False
9446    False
9447    False
9448    False
9449    False
9450    False
9451    False
9452    False
9453    False
9454    False
9455    False
9456    False
9457    False
9458    False
9459    False
9460    False
9461    False
9462    False
9463    False
9464    False
9465    False
9466    False
9467    False
9468    False
9469    False
9470    False
Name: CO(GT), Length: 9471, dtype: bool

True

In [346]:
filter_2 = airquality['CO(GT)'] > 3.0
filter_2.all()

False

<h1 style="font-size:2em;color:#2467C0">Handling Missing Data</h1>

If you looked at the numbers, you may have noticed that a lot of them were -200.0. That doesn't seem like a reasonable pollutant concentration, so perhaps the creators of the dataset intended that to be a NULL value. Assuming this is the case, let's fill all Null values to be -200.0.

In [347]:
airquality.shape

(9471, 15)

In [348]:
#Check if there are Null values in each row
airquality.isnull().any()

Date             True
Time             True
CO(GT)           True
PT08.S1(CO)      True
NMHC(GT)         True
C6H6(GT)         True
PT08.S2(NMHC)    True
NOx(GT)          True
PT08.S3(NOx)     True
NO2(GT)          True
PT08.S4(NO2)     True
PT08.S5(O3)      True
T                True
RH               True
AH               True
dtype: bool

In [349]:
airquality_filled = airquality.fillna(value=-200.0)

In [350]:
airquality_filled.isnull().any()

Date             False
Time             False
CO(GT)           False
PT08.S1(CO)      False
NMHC(GT)         False
C6H6(GT)         False
PT08.S2(NMHC)    False
NOx(GT)          False
PT08.S3(NOx)     False
NO2(GT)          False
PT08.S4(NO2)     False
PT08.S5(O3)      False
T                False
RH               False
AH               False
dtype: bool

The NULL values are gone, and now our data is consistent. We can use rows which have some NULL columns if we want by using airquality_filled, where the NULL values are replaced with the value -200.0. However, we can get rid all samples with NULL columns in the original DataFrame if we want to use only complete observations.

In [354]:
airquality = airquality.dropna()

In [355]:
airquality.isnull().any()

Date             False
Time             False
CO(GT)           False
PT08.S1(CO)      False
NMHC(GT)         False
C6H6(GT)         False
PT08.S2(NMHC)    False
NOx(GT)          False
PT08.S3(NOx)     False
NO2(GT)          False
PT08.S4(NO2)     False
PT08.S5(O3)      False
T                False
RH               False
AH               False
dtype: bool

In [356]:
airquality.shape

(9357, 15)

Thats nice ! No NULL rows ! Any observation with a NULL value has been removed. Therefore, the number of rows as been reduced.